In [3]:
import pandas as pd
player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

df = pd.DataFrame(player_list, columns = ['Name','Age','Weight','Salary'])

In [4]:
df

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [5]:
# Slicing the dataset by specifying no. of rows and columns
df.iloc[0:2,0:2]

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38

In [6]:
df.iloc[:,0:3]

            Name  Age  Weight
0      M.S.Dhoni   36      75
1  A.B.D Villers   38      74
2        V.Kohli   31      70
3        S.Smith   34      80
4        C.Gayle   40     100
5         J.Root   33      72
6     K.Peterson   42      85

In [11]:
# Retriving specific data from the dataset
specific_cv=df.iloc[2,2]
print("Specific cell value", specific_cv)

Specific cell value 70

In [14]:
# Using boolean conditions in python
filtered_data = df[df['Age']>35].iloc[:,:]
print(filtered_data)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [20]:
# slicing using loc[]
df_custom = df.set_index("Name")
print("df_Custom",df_custom)
print("\n")
custom_slice = df_custom.loc["C.Gayle":'K.Peterson']
print("Custom Slice",custom_slice)

df_Custom                Age  Weight   Salary
Name
M.S.Dhoni       36      75  5428000
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000
C.Gayle         40     100  4528000
J.Root          33      72  7028000
K.Peterson      42      85  2528000


Custom Slice             Age  Weight   Salary
Name
C.Gayle      40     100  4528000
J.Root       33      72  7028000
K.Peterson   42      85  2528000